fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Сначала получаем процент ставки сотрудника, чтобы избежать неоптимального СрезПоследних в тяжелом соединении
	ПроцентОтРабот = -1;
	ЗапросСтавки = Новый Запрос;
	ЗапросСтавки.Текст = 
		"ВЫБРАТЬ Первые 1
		|	УсловияОплаты.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК УсловияОплаты";
	ЗапросСтавки.УстановитьПараметр("Сотрудник", Специалист);
	ЗапросСтавки.УстановитьПараметр("Период",    Дата);
	
	ВыборкаСтавки = ЗапросСтавки.Выполнить().Выбрать();
	Если ВыборкаСтавки.Следующий() Тогда
		ПроцентОтРабот = ВыборкаСтавки.ПроцентОтРабот;
	КонецЕсли;
	
	Если ПроцентОтРабот = -1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно: на дату документа специалисту не установлен процент оплаты от работ"); 
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// Основной запрос для формирования движений
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК КоличествоЧасов
		|ПОМЕСТИТЬ ВТ_Работы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Сотрудник,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ЕСТЬNULL(ВТ_Работы.КоличествоЧасов, 0) КАК КоличествоЧасов,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы, 0) * ЕСТЬNULL(ВТ_Работы.КоличествоЧасов, 0) КАК СуммаКОплате,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Период
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Работы КАК ВТ_Работы
		|		ПО ВКМ_ОбслуживаниеКлиента.Ссылка = ВТ_Работы.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ВведенныеДанныеКорректны(Выборка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// 1. Регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	// 2. Регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	Движение.СуммаКОплате = Выборка.СуммаКОплате * ПроцентОтРабот / 100;
	Движение.ЧасовКОплате = Выборка.КоличествоЧасов;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	ДокументИзменен = Ложь;
	ДанныеОбслуживания = СтруктураДанныхОбслуживания();	

	// Архитектурное исправление: Проверяем изменения через старую копию объекта из базы
	Если ЭтоНовый() Тогда
		ДанныеОбслуживания.Создан = Истина;
		ДокументИзменен = Истина;
	Иначе
		// Получаем состояние объекта до изменения текущим пользователем
		СсылкаНаОбъектБД = Ссылка.ПолучитьОбъект();
		
		Если СсылкаНаОбъектБД.Специалист <> Специалист Тогда
			ДанныеОбслуживания.Специалист = СтрШаблон("%1 (изменен с %2)", Специалист, СсылкаНаОбъектБД.Специалист);			
			ДокументИзменен = Истина;
		КонецЕсли;
		
		Если СсылкаНаОбъектБД.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
			ДанныеОбслуживания.ДатаПроведенияРабот = СтрШаблон("%1 (изменена с %2)", 
				Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(СсылкаНаОбъектБД.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));			
			ДокументИзменен = Истина;
		КонецЕсли;
		
		Если СсылкаНаОбъектБД.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
			ДанныеОбслуживания.ВремяНачалаРабот = СтрШаблон("%1 (изменено с %2)", 
				Формат(ВремяНачалаРабот, "ДФ=HH:mm;"), Формат(СсылкаНаОбъектБД.ВремяНачалаРабот, "ДФ=HH:mm;"));			
			ДокументИзменен = Истина;
		КонецЕсли;

		Если СсылкаНаОбъектБД.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
			ДанныеОбслуживания.ВремяОкончанияРабот = СтрШаблон("%1 (изменено с %2)", 
				Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"), Формат(СсылкаНаОбъектБД.ВремяОкончанияРабот, "ДФ=HH:mm;"));			
			ДокументИзменен = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Если ДокументИзменен Тогда
		ТекстСообщения = СгенерироватьТекстОДокументе(ДанныеОбслуживания);
		СоздатьУведомлениеТелеграмБоту(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВведенныеДанныеКорректны(Выборка)
	
	ДанныеКорректны = Истина;

	Если Выборка.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ДанныеКорректны = Ложь;
		ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно: Выбран неподходящий тип договора.",,"Договор","Объект");
		Возврат ДанныеКорректны;
	КонецЕсли;
	
	Если Дата < Выборка.ВКМ_ДатаНачалаДействияДоговора Или Дата > Выборка.ВКМ_ДатаОкончанияДействияДоговора Тогда
		ДанныеКорректны = Ложь;
		ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно: Дата документа за пределами периода действия договора.",,"Дата","Объект");
	КонецЕсли;
		
	Если ДатаПроведенияРабот < Выборка.ВКМ_ДатаНачалаДействияДоговора Или ДатаПроведенияРабот > Выборка.ВКМ_ДатаОкончанияДействияДоговора Тогда
		ОбщегоНазначения.СообщитьПользователю("Предупреждение: Дата проведения работ за пределами периода действия договора.",,"ДатаПроведенияРабот","Объект");
	КонецЕсли;	
	
	Возврат ДанныеКорректны;
	
КонецФункции

// Создание элемента справочника ВКМ_УведомленияТелеграмБоту
Процедура СоздатьУведомлениеТелеграмБоту(ТекстСообщения)
	
	Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	Уведомление.ТекстСообщения = ТекстСообщения;
	Уведомление.Записать();	
	
КонецПроцедуры	

Функция СтруктураДанныхОбслуживания()
	
	ДанныеОбслуживания = Новый Структура;
	ДанныеОбслуживания.Вставить("Специалист",          Строка(Специалист));
	ДанныеОбслуживания.Вставить("ДатаПроведенияРабот", Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));
	ДанныеОбслуживания.Вставить("ВремяНачалаРабот",     Формат(ВремяНачалаРабот, "ДФ=HH:mm;"));
	ДанныеОбслуживания.Вставить("ВремяОкончанияРабот",  Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"));
	ДанныеОбслуживания.Вставить("Создан",              Ложь);
	
	Возврат ДанныеОбслуживания; 
	
КонецФункции

Функция СгенерироватьТекстОДокументе(ДанныеОбслуживания)
	
	Статус = ?(ДанныеОбслуживания.Создан, "Создан новый", "Изменен");
	
	ТекстСообщения = СтрШаблон("
	|%1 документ на обслуживание №%2 от %3
	|Специалист: %4
	|Клиент: %5
	|Договор: %6
	|Дата проведения работ: %7
	|Время проведения работ: %8 - %9
	|Описание проблемы: %10
	|", Статус, ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер), 
		Дата, ДанныеОбслуживания.Специалист, Клиент, Договор,
		ДанныеОбслуживания.ДатаПроведенияРабот, ДанныеОбслуживания.ВремяНачалаРабот,
		ДанныеОбслуживания.ВремяОкончанияРабот, ОписаниеПроблемы);
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
